load-test.yml
# config:
#   target: "http://localhost:3001"
#   phases:
#     - duration: 10
#       arrivalRate: 100

# scenarios:
#   - name: "list products"
#     flow:
#       - get:
#           url: "/products"

# config:
#   target: "http://localhost:3001"
#   phases:
#     - duration: 10
#       arrivalRate: 20
#       name: "Warming up"
#     - duration: 20
#       arrivalRate: 20
#       rampTo: 80
#       name: "Ramping up"
#     - duration: 30
#       arrivalRate: 100
#       name: "Sustained load"
  # processor: "./processor.js"

config:
  target: "http://localhost:3001"
  phases:
    - duration: 10
      arrivalRate: 10
      name: Warm up
    - duration: 20
      arrivalRate: 10
      rampTo: 40
      name: Ramp up load
    - duration: 30
      arrivalRate: 100
      name: Sustained load

scenarios:
  - name: "Open page"
    flow:
      - get:
          url: "/products"
      - get:
          url: "/products/{{$randomNumber(1,1000011)}}"
      - get:
          url: "/products/{{$randomNumber(1,1000011)}}/styles"
      - get:
          url: "/products/{{$randomNumber(1,1000011)}}/related"